docs/posts/2016-01-30-the-body-just-quits.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Body Just Quits</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Body Just Quits</h1>
<p class="subtitle" role="doc-subtitle">Jan 30, 2016</p>
</header><p>
We left Accra, Ghana at 2300 last Saturday night. After thirty hours of traveling, we arrived in Oklahoma City. Monday night, I had to go visit my father at his hospital. Tuesday and Wednesday, I taught a Bible study on forgiveness at First Baptist Church, Sparks, OK. Thursday night, I had my three hour political philosophy class. Finally, on Friday, I came down with a stomach bug, for which I should be thankful — I went to bed and slept for eighteen hours.
</p>


<div class="tagline" id="org49c732e">
<p>
Tagged: <a href="../tags/misc.html">Misc</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
